rails_project/alpha-blog/app/controllers/articles_controller.rb

    def create

        @article = Article.new(article_params)
        @article.user = current_user
        if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "testing for user"], ["description", "hoping for no issues with user"], ["created_at", "2020-01-21 17:59:35.902243"], ["updated_at", "2020-01-21 17:59:35.902243"], ["user_id", 3]]