rails_project/alpha-blog/app/controllers/users_controller.rb

    def update

        if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Mashur"], ["email", "mashur.hossain@gmail.com"], ["updated_at", "2020-01-27 19:05:37.401414"], ["id", 5]]